huming2207/soulcloud_client_demo/sdkconfig.defaults
# Soulcloud client demo — ESP32-S3 devkitc-1 (8 MB flash + 8 MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# stat.fw must carry the FULL ELF SHA-256 (32 bytes) so the backend can
# match it against firmware_artifacts.buildId (OTA completion + log decode).
# IDF's default IDF divides the RAM buffer (len+1) by two when converting hex,
# so len=32 would still yield only 16 bytes; 64 yields the full 32 bytes.
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=64

# PSRAM (octal, 80 MHz, auto-detect type)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SOULCLOUD_CORE_TASK_STACK_PSRAM=y

# Custom partition table: nvs + otadata + dual OTA app slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# MQTT over WebSocket transport (defaults are already y; pinned explicitly)
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_WS_TRANSPORT=y
CONFIG_WS_BUFFER_SIZE=4096

# OpenETH driver compiled in (used by the QEMU ethernet demo mode)
CONFIG_ETH_USE_OPENETH=y
